#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

module.apiGateway.data.aws_vpcs.selected: Reading...
aws_secretsmanager_secret.lambda_auth_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:590183830079:secret:lambda-auth-credentials-AhBLBE]
data.aws_iam_role.name: Reading...
module.apiGateway.aws_api_gateway_rest_api.tech_lanches_api_gateweay: Refreshing state... [id=ezq2k82ak8]
module.cognito.aws_cognito_user_pool.tech_lanches_clientes_pool: Refreshing state... [id=us-east-1_ASZqanQty]
data.aws_iam_role.name: Read complete after 0s [id=LabRole]
module.lambda.aws_lambda_function.tech_lanches_lambda_auth: Refreshing state... [id=tech-lanches-lambda-auth]
module.lambda.aws_lambda_function.tech_lanches_lambda_cadastro: Refreshing state... [id=tech-lanches-lambda-cadastro]
module.apiGateway.aws_api_gateway_resource.cadastro: Refreshing state... [id=wq320w]
module.apiGateway.aws_api_gateway_resource.auth: Refreshing state... [id=b15d1h]
module.cognito.aws_cognito_user_pool_client.tech_lanches_clientes_pool_client: Refreshing state... [id=657vceh3hv19f4kgnjhubcn2jr]
module.apiGateway.data.aws_vpcs.selected: Read complete after 1s [id=us-east-1]
module.apiGateway.data.aws_vpc.eks_vpc: Reading...
module.apiGateway.data.aws_subnets.selected: Reading...
module.apiGateway.aws_api_gateway_method.auth: Refreshing state... [id=agm-ezq2k82ak8-b15d1h-POST]
module.apiGateway.aws_api_gateway_method.cadastro: Refreshing state... [id=agm-ezq2k82ak8-wq320w-POST]
aws_secretsmanager_secret_version.lambda_auth_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:590183830079:secret:lambda-auth-credentials-AhBLBE|terraform-20240315020615711100000002]
module.apiGateway.aws_lambda_permission.apigateway_lambda_cadastro: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apiGateway.aws_api_gateway_integration.lambda_cadastro: Refreshing state... [id=agi-ezq2k82ak8-wq320w-POST]
module.apiGateway.aws_lambda_permission.apigateway_lambda_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apiGateway.aws_api_gateway_integration.lambda_auth: Refreshing state... [id=agi-ezq2k82ak8-b15d1h-POST]
module.apiGateway.data.aws_subnets.selected: Read complete after 0s [id=us-east-1]
module.apiGateway.data.aws_subnet.selected["subnet-02da7b3bff35ffd34"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-0f476e69cc63013f8"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-0b804732f842bbfcc"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-0c20e39f90f3969a6"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-00dcf9f08898b66c2"]: Reading...
module.apiGateway.data.aws_subnet.selected["subnet-021df87e50e29978f"]: Reading...
module.apiGateway.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=diwvi8]
module.apiGateway.data.aws_subnet.selected["subnet-02da7b3bff35ffd34"]: Read complete after 0s [id=subnet-02da7b3bff35ffd34]
module.apiGateway.data.aws_subnet.selected["subnet-0f476e69cc63013f8"]: Read complete after 0s [id=subnet-0f476e69cc63013f8]
module.apiGateway.data.aws_subnet.selected["subnet-0c20e39f90f3969a6"]: Read complete after 0s [id=subnet-0c20e39f90f3969a6]
module.apiGateway.data.aws_subnet.selected["subnet-021df87e50e29978f"]: Read complete after 0s [id=subnet-021df87e50e29978f]
module.apiGateway.data.aws_subnet.selected["subnet-00dcf9f08898b66c2"]: Read complete after 0s [id=subnet-00dcf9f08898b66c2]
module.apiGateway.data.aws_vpc.eks_vpc: Read complete after 0s [id=vpc-09d1ed1b68c25abb0]
module.apiGateway.data.aws_subnet.selected["subnet-0b804732f842bbfcc"]: Read complete after 0s [id=subnet-0b804732f842bbfcc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.apiGateway.aws_api_gateway_integration.proxy will be created
  + resource "aws_api_gateway_integration" "proxy" {
      + cache_namespace         = (known after apply)
      + connection_id           = (known after apply)
      + connection_type         = "VPC_LINK"
      + content_handling        = "CONVERT_TO_TEXT"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "ANY"
      + passthrough_behavior    = "WHEN_NO_MATCH"
      + request_parameters      = {
          + "integration.request.header.Accept"        = "'application/json'"
          + "integration.request.header.Authorization" = "method.request.header.Authorization"
          + "integration.request.path.proxy"           = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "http://a304428c8c3b9415f882254828917660-1346e20a00e4ec45.elb.us-east-1.amazonaws.com:5050/{proxy}"
    }

  # module.apiGateway.aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Authorization" = true
          + "method.request.path.proxy"           = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Foobar Gateway used for EKS. Managed by Terraform."
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "foobar_gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.apiGateway.aws_api_gateway_vpc_link.main will be created
  + resource "aws_api_gateway_vpc_link" "main" {
      + arn         = (known after apply)
      + description = "Foobar Gateway VPC Link. Managed by Terraform."
      + id          = (known after apply)
      + name        = "foobar_gateway_vpclink"
      + tags_all    = (known after apply)
      + target_arns = [
          + "arn:aws:elasticloadbalancing:us-east-1:637423589454:loadbalancer/net/a304428c8c3b9415f882254828917660/1346e20a00e4ec45",
        ]
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @nsosoares, Action: `pull_request`*